#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ Ġ
ĠĠ ĠĠ
Ġ %
Ġ i
ĠĠĠĠ ĠĠĠĠ
Ċ Ġ
Ġ =
a l
Ġ !
3 2
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġ al
s t
g n
i gn
Ġal ign
Ġ l
6 4
b a
t ba
tba a
r e
Ġ 8
c t
a d
e l
r u
ru ct
* ,
d s
o ad
Ġl oad
* *
Ġ b
a b
m e
o u
e t
st ruct
Ġl ab
Ġlab el
Ġ @
Ġ 4
Ġ p
Ġ c
0 0
c a
Ġ t
1 0
r t
n t
Ġt o
Ġ 0
. _
al l
Ġ ;
re ds
Ġp reds
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
1 2
1 3
Ġb r
Ġc all
Ġ [
Ġ x
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
o i
l e
Ġ #
s e
t r
I O
ou n
o re
Ġ st
Ġst ore
F I
L E
FI LE
1 1
l o
Ġ v
i t
oi d
Ġv oid
g et
e x
l l
Ġ "
a t
" =
"= "
el e
b oun
n boun
p tr
Ġ get
Ġi nboun
me nt
ele ment
Ġget element
Ġinboun ds
Ġgetelement ptr
1 4
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
l i
f et
i me
v m
ll vm
li fet
lifet ime
Ġ 1
Ġb it
ca st
Ġbit cast
b le
d ou
dou ble
1 5
1 7
Ġal lo
Ġallo ca
n d
st a
1 6
f al
fal se
S t
D V
e rt
m y
ex St
DV ert
exSt ruct
DVert exStruct
Ġ n
] ,
1 8
Ġ double
Ġ (
1 9
m p
] *
c mp
o n
d e
Ġ u
2 0
f p
Ġi cmp
3 0
00 00
st r
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
e nd
sta rt
m at
mat h
. .
w i
ad d
Ġ s
i n
r i
2 7
2 4
, +
6 0000
2 3
a r
e r
* )
n o
" ,
e d
2 2
oun wi
Ġn ounwi
Ġnounwi nd
a me
Ġ% .
g e
u n
{ !
Ġ! {!
ex t
2 1
Ġ {
s o
z ext
Ġ zext
s w
ab le
( %
Ġ@ .
Ġ( [
Ġu n
2 6
3 3
lo c
n ame
Ġ ds
loc al
Ġds o
x t
Ġ se
Ġse xt
2 5
2 9
o r
d i
t e
. )
@ .
a re
v at
Ġ ..
Ġp ri
Ġc on
sta nt
de c
add r
Ġun name
vat e
Ġ.. .)
Ġpri vate
Ġcon stant
Ġunname d
ed ge
oi nt
F un
A t
i on
Ġ Fun
Ġ At
ct ion
tr s
ĠFun ction
ĠAt trs
8 7
b u
4 3
4 1
9 9
2 8
a p
3 7
t ar
tar get
l t
l are
p e
dec lare
* ]*
4 8
c r
cr it
3 6
3 9
re t
Ġ add
f s
Ġ }
8 6
3 8
3 5
3 4
4 0
3 1
9 3
Ġ ],
t able
Ġn sw
u b
f e
s se
) ,
* ],
e q
Ġ 2
Ġ( %
Ġs ub
4 4
4 2
10 6
4 5
5 0
5 7
w table
Ġu wtable
f in
l y
a n
i bu
tr ibu
at tribu
di v
te s
attribu tes
Ġ f
Ġ o
Ġ eq
nt f
ri ntf
Ġ!{! "
c k
Ġ% ._
s a
sw ap
12 8
10 2
h i
Ġ ]
Ġp hi
4 9
Ġ ret
de fin
defin e
4 6
ct or
m m
p u
q rt
s qrt
u re
) )
d at
r n
r r
u rn
Ġu lt
so rt
8 3
u ll
5 2
t rt
Ġp trt
Ġptrt oint
4 7
5 1
7 8
*) *
1 12
9 6
7 7
11 4
5 6
14 4
*) *,
*) **
8 0
9 5
6 1
8 4
1 00
10 5
o te
in g
oint er
_ _
a i
f o
i so
n f
y pe
Ġ 24
me m
Ġ@ __
ca nf
Ġt ype
Ġ1 6
fp rintf
ar g
pe n
fs canf
ai l
iso c
c o
9 0
12 3
13 9
ex it
5 8
7 0
Ġ false
1 10
5 5
6 0
10 1
11 8
5 3
5 9
8 9
11 9
7 1
Ġn e
13 6
11 1
6 2
7 3
7 5
9 1
7 9
7 2
7 6
8 5
6 8
8 2
9 4
9 8
6 3
13 3
5 4
6 7
6 5
6 9
8 8
10 3
8 1
10 7
Ġ -
10 9
6 6
9 7
c i
c x
c all
c or
c pu
f f
f r
f t
f x
f lo
i z
i de
m ad
n on
n an
o s
p r
p re
p ing
p ointer
r oun
s r
s s
s ign
s able
s iz
t ail
u se
z er
re ct
le ss
tr ap
at ure
"=" +
sta ck
de d
fp mad
in fs
un sa
so ft
di sable
bu ff
fe ature
div ide
mm x
ote ctor
ci se
call s
cor rect
fr ame
fx sr
flo at
non e
nan s
pr otector
pre cise
roun ded
sign ed
siz e
zer os
trap ping
unsa fe
buff er
feature s
correct ly
c lo
f clo
g t
o w
p ow
st de
Ġs lt
dat a
fo pen
Ġ24 0
fclo se
stde rr
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
11 7
1 13
7 4
11 6
12 0
16 1
19 8
11 5
Ġn ull
10 8
12 9
18 3
12 4
13 7
1 32
12 1
13 0
12 2
* *,
** *
12 5
13 1
10 4
12 6
13 8
9 2
13 4
14 0
14 1
14 2
14 3
19 7
ou t
n al
er nal
16 8
on ly
" %
" \
a q
a in
i le
m ain
o rt
o fp
p aq
q sort
t urn
u e
Ġ 3
Ġ C
Ġ wi
Ġ arg
ore turn
it ofp
ll ret
Ġn oreturn
Ġu le
0000 00
Ġs ge
Ġs itofp
Ġo paq
mem only
Ġwi llret
Ġarg memonly
Ġopaq ue
Ġwillret urn
12 7
13 5
ba ck
back edge
17 2
19 6
20 3
16 5
t h
14 6
16 7
19 0
2 12
2 13
n ull
Ġn on
Ġnon null
a c
h able
Ġi nt
re ac
Ġint ernal
reac hable
18 5
e ctor
' t
A E
c e
f ile
h ort
k er
m u
m ar
o m
o ca
p t
p rintf
s et
s hort
v t
Ġ 144
Ġ mu
Ġi mm
re g
Ġn oca
mp are
Ġu gt
wi de
Ġs div
dec vt
Ġf cmp
Ġf add
pu t
rr or
co mpare
co decvt
data set
out put
qsort x
ĠC an
AE rror
mar ker
pt ure
short sort
Ġ144 0000
Ġmu l
Ġimm arg
Ġnoca pture
15 1
Ġun reachable
15 0
15 7
17 5
20 4
15 9
18 1
20 1
2 19
15 5
17 9
16 6
18 2
18 7
18 9
19 5
19 9
20 8
17 0
16 3
18 8
19 4
1 64
2 00
14 5
14 7
14 8
14 9
15 2
15 3
15 4
15 6
15 8
17 1
17 3
17 4
17 6
17 7
17 8
16 0
16 2
16 9
18 0
18 4
18 6
19 1
19 2
19 3
20 2
20 5
20 6
20 7
2 10
2 11
2 14
2 15
2 17
2 16
2 18
2 20
20 9
22 1
22 2
c s
l cs
lcs sa
re ad
th read
0 1
n i
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
d th
g al
j u
m in
v ector
le gal
wi dth
table s
ju mp
! \
" _
" }
' -
+ +
- "
. \
> \
A A
A S
B AA
I D
M o
S i
T BAA
U sa
a y
b al
d u
g lo
g in
h e
h ar
i nt
i nd
k no
l d
l ar
n c
n g
n u
n ce
p le
p ote
r ce
r om
s ou
w n
w t
Ġ <
Ġ ba
Ġ on
Ġ 60000
Ġ ext
Ġ di
Ġ dat
Ġ qsort
Ġ dataset
Ġ output
Ġ '-
Ġ Mo
Ġ TBAA
Ġ glo
al ay
gn u
ru nc
Ġp ointer
Ġc har
Ġt ri
Ġt he
Ġt runc
le ID
se d
lo ng
Ġv ector
Ġ" -"
ele ct
li nu
Ġ1 00
sta nce
mp le
Ġu div
Ġs le
Ġs gt
Ġs elect
ri gin
27 0
27 1
27 2
un kno
fin fo
an y
Ġf ile
Ġf ind
Ġf rom
Ġo eq
Ġo pen
Ġo gt
Ġo rigin
sort ed
ort ing
file name
om ni
AS orting
Si mple
Usa ge
du leID
lar ge
pote nt
sou rce
Ġba sed
Ġext ernal
Ġdi stance
Ġdat alay
Ġ'- '
ĠMo duleID
Ġglo bal
Ġtri ple
Ġvector s
linu x
unkno wn
omni potent
Ġdatalay out
Ġt ail
R e
p l
de Re
co deRe
codeRe pl
0 12
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
0 2
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
0 14
l oad
re load
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
0 13
Ġ% "
Ġp oint
0 15
a ct
tr act
ex tract
23 4
extract ed
p h
0 5
23 3
out er
0 7
2 32
24 8
24 9
23 9
22 6
o p
lo op
loop exit
2 30
2 27
2 24
2 23
R o
c Ro
e w
n ew
o t
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
St ub
24 0
24 1
24 2
24 3
24 4
24 5
24 6
24 7
23 1
23 5
23 6
23 7
23 8
22 5
22 8
22 9
25 0
25 1
25 2
25 3
25 4
25 5
25 6
25 7
25 8
Fun cRo
exit Stub
new FuncRo
newFuncRo ot
0 8
0 10
B loc
U n
U ni
b e
f i
ed Un
reachable Bloc
Uni fi
edUn reachableBloc
Unifi edUnreachableBloc
UnifiedUnreachableBloc k
0 16
0 18
Ġ read
ĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
Ġread only
